#   -*- mode: org; fill-column: 60 -*-
#+TITLE: Introduction to the Trivium
#+STARTUP: showall
#+PROPERTY: filename
  :PROPERTIES:
  :Name: /home/deerpig/proj/chenla/trivium/triv-introduction.org
  :Created: 2017-02-13T12:32@Prek Leap (11.642600N-104.919210W)
  :ID: 3485b3fc-3c51-4459-847c-462b7a5d040f
  :URL:
  :END:
#+INCLUDE: ./inc/head.org
#+INCLUDE: ./inc/macros.org

{{{breadcrumbs}}}

#+HTML: <div class="outline-2" id="meta">
| *Author*  | Brad Collins <brad@chenla.org>             |
| *Date*    | {{{time(%Y-%m-%d %H:%M:%S)}}}              |
#+HTML: </div>

#+TOC: headlines 4


* Status of This Document

The latest version of this document is: src_sh[:results value]{git describe --abbrev=0 --tags}

#+HTML: <div class="notice notice-info">
*Changes since the last version*

#+HTML: <ul>

#+BEGIN_SRC sh :exports results :results value html :var TAG="v00.01.02"
  RES='git log $TAG...HEAD --pretty="<li>%s</li>\n" -- (file-name-nondirectory (buffer-file-name))'
  if [ -z $RES ]; then
    RES="<li>no changes</li>"
  fi
  echo $RES
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
<li>no changes</li>
#+END_EXPORT

#+HTML: </ul>
#+HTML: </div>

* Introduction

Keep in mind that this not the Medieval Trivium, though much has been
borrowed from it, including a lot of nomenclature. It would be better
to call this the /Scopic Trivium/.  We will learn more about Scopic
Philosophy later in this introduction.

The Medieval Trivium was the equivilent of a modern College or
University Bachelor's Degree.  And the Medievel Trivium is still the
ancient ancestor of the Liberal Arts Bachelor's degree program, though
one must often squint with just the right amount of grimmace to see it
at times.



* Scopic Philosophy

It was really only recently that I realized that my relentlessly
evolving concept of Scope had become— while I was not watching—a
philosophy in its own right.

Every Civilization is built on philosophical tradtions that contain
many variations over time and location, but like in Jazz
improvisation, still manage to stay within the theme set at the
beginning.  The Western Tradition that Western Civilization is based
on Greek/Roman tradition.  If there is an Eastern Tradition, it could
be argued that it is based originally on Hindu mytholody and was later
refined into Buddhist/Confucian Tradation.   

It is my belief that a new Tradition will need to be established in
order for a truly distributed, /solar civlization/ to be possible that
reflects the fundemental change that mankind is undergoing that is
redefining its relationship to nature and the universe.

This is not to say that Scopic Philosophy will be the foundation for
/anything/, let along the foundation an underpinning Tradition for a
civilizaion, but I do hope that it will be useful for those who do.

** Components

Scopic Philosophy is modular in that it provides a framework for
understanding how the world works.  But it can also be combined with
any number of classical philosophies of life.  It works extremely well
in combination with Skepticism and Epicureanism.

  - Reconciles Atomist and Holistic views of the World.
  - A concept of Time and Causality based on Process Philosophy
  - A Temporal Model based Scope (Context: LOD, POV ROC)
  - A Dynamicly Changing Cosmology that reflects the current scientic consensus
    of how the Universe works based on the scientific method.
  - Plug-in Philosophy of Life
  - Plug-in Phlosophy of lifelong learning

